{
	"entries":[
		{
		"date":"04/13/2015",
		"title":"Hi, my name is...",
		"text":"&#91disclaimer: I'm not a blogger because I'm not a writer by nature. I need 12 mental edits before I even speak out loud and then I'm STILL not satisfied. Therefore a first draft blog entry is way below what I'm comfortable with sharing, and there just are not enough minutes in a day to do the edits I want to do. That being said, here are my ramblings.&#93<br><br>The day had its share of introductions. Not just of the instructor and my cohorts but introductions to a number of tools such as Notebook++ and Everything (which I'll throw onto my pc as soon as I get home). We each got to boot a machine and play around with these tools. We also set up accounts with various services including but not limited to gmail, google voice, dropbox, stack overflow, Github, and twitter. Much of the morning, while still exploratory, was largely clerical as the accounts were squared away. The fun began when we played with the code for a twitter bot. There were really only a few lines of code, but it was enough to tweet phrases out of a text file. It's one thing to write code that outputs \"Hello, world,\" to a screen but it's more fun to actually work on something that sends out messages to the entire world (of twitter, at least). We then jumped into git, where our code will live. "
		},
		{
		"date":"04/14/2015",
		"title":"D10, I choose you!",
		"text":"&#91disclaimer: I'm not a blogger because I'm not a writer by nature. I need 12 mental edits before I even speak out loud and then I'm STILL not satisfied. Therefore a first draft blog entry is way below what I'm comfortable with sharing, and there just are not enough minutes in a day to do the edits I want to do. That being said, here are my ramblings.&#93<br><br>Although we played with code yesterday, today is the first day we were officially learning what we are doing from the ground up: what is a variable, what is a boolean, etc. We looked at lists and how to manipulate them. There is enough information that may be considered basic to make me feel comfortable but there's still enough that I have to google to find the correct command or the correct syntax. The interesting part of the day is when we played a simple dice game with physical dice, making up and modifying the rules of the game as we went. Based on what we learned the first day (and with the help of prior knowledge, google, and stack overflow) we were to code a version of the game. Even with varying prior coding experience I think that each pair of students is up to the challenge. We're able to help each other as we go, reinforcing things we may have just learned.<br><br>Regular breaks away from the workstations are strongly encouraged, which is difficult with me-- although I appreciate a break when stuck I'd like to keep going when I think I have a flow."
		},
		{
		"date":"04/15/2015",
		"title":"Hump day.",
		"text":"&#91disclaimer: I'm not a blogger because I'm not a writer by nature. I need 12 mental edits before I even speak out loud and then I'm STILL not satisfied. Therefore a first draft blog entry is way below what I'm comfortable with sharing, and there just are not enough minutes in a day to do the edits I want to do. That being said, here are my ramblings.&#93<br><br>Most of us didn't finish the lab from yesterday, so we started the day on that. The lab involved exploring string/list manipulation. I personally spent a lot of time trying to figure out the best way to test if an object exists in two different lists. Logically, it is the intersection of the two sets, but it seems like not only is there not a pre-made function (method? operation?), but according to the internets the best way to do this is with sets, a subject I would be happy to delve into when the need becomes, well, overwhelming... It's not that I don't want to learn something new (that is why I'm here, after all), but I think it best to take in my knowledge in categorized chunks, and something like sets does not fit into any of the chunks I'm currently nibbling on.<br><br>The second half of the day was spent on coding as a group. There were certainly pluses and minuses to this, as I'm sure was part of the point. The exercise gave us the opportunity to work together and share ideas. It allowed people to ask questions and see multiple solutions to a problem. It also showed that multiple solutions can each be valid, but they are not necessarily valid together. But we also got to an end of sorts, which I'd consider a success."
		},
		{
		"date":"04/16/2015",
		"title":"Putting the Fun in Functions (or Life is Like an Infinite Loop So Sometimes You Need a Break)",
		"text":"&#91disclaimer: I'm not a blogger because I'm not a writer by nature. I need 12 mental edits before I even speak out loud and then I'm STILL not satisfied. Therefore a first draft blog entry is way below what I'm comfortable with sharing, and there just are not enough minutes in a day to do the edits I want to do. That being said, here are my ramblings.&#93<br><br>We presented our first code today. It's was nice to see how other teams approached the same problems and sometimes found similar solutions and sometimes did it a different way. It was also nice to see some issues still remained in everyone's code-- nobody is &#91yet&#93 perfect.<br><br>The reason you can read this blog is because today we set it up. We dealt with json files (although we didn't really delve into much detail) and a tiny bit of html.<br><br>Our lecture material was on functions(yay!) and loops(also yay!) but with loops come the need for breaks and trying to figure out why breaks break functions but don't break the way I wanted them to break. However, finally getting it to work was a good win for the day."
		},
		{
		"date":"04/17/2015",
		"title":"Steam Blown",
		"text":"&#91disclaimer: I'm not a blogger because I'm not a writer by nature. I need 12 mental edits before I even speak out loud and then I'm STILL not satisfied. Therefore a first draft blog entry is way below what I'm comfortable with sharing, and there just are not enough minutes in a day to do the edits I want to do. That being said, here are my ramblings.&#93<br><br>New lab today, based on the loops and functions we went over yesterday. Got through quickly, so then I went back to the twit bot and the dice game, concurrently. For the twit bot, I wanted to randomly switch the locations that it was checking for trending topics and from each list I wanted a random topic. This makes things more interesting and dynamic than just choosing the top trending topic in Chicago, which could be the same for hours. It was also breaking when a tweet was over the character limit, so I needed to find how to prevent a long tweet from being sent. For the dice program, much of the code is spent doing something in regards to player 1, then doing the exact same thing for player 2. So I tried to condense the code by adding for-each loops where I could. While this was largely successful, it also brought about a problem with pointers, which is another topic that is beyond my current comfort zone. Or at least it was when I first met them a year and a half ago. So far, today, it's not too bad. The afternoon brought a necessary part of software development: blowing off steam. For us that meant booting up Steam. I haven't played a first person shooter since Quake III. That's older than some of my daughters. So I was little help to my fellow classmates in our attempt to frag our instructors. I also got more done with my dice game and will be polishing it up this weekend. Not because it's required for class. It's just fun.<br><br>"
		},
		{
		"date":"04/20/2015",
		"title":"Blank page on a Monday morning?!?",
		"text":"&#91disclaimer: see above disclaimer&#93<br><br>Where did all my steam go? I think I must have wasted it over the weekend. In whatever time I had to code I was throwing in little bits of text formatting into my dice game, tweaks to my twit bot, or learning about the ComicVine API so in a future little program I was send the cover of a comic book to a notifier app like Boxcar. Today though, I was double stumped. First by the dreaded blank page. Coming up with a worthy project has long been an issue with me. I can more easily meet an objective if I'm given an objective but sometimes I can't get out of the starting gate if the first step is my own idea. And then I spent all morning double guessing and changing that idea. But at least it's moving now. The other half of my stumpedness was getting my head around MongoDB, which looks sooooo much easier than I found it to be. I often look at a few examples of code and see where they overlap as the necessary parts. The 'simple' examples I found were all using different methods so I couldn't see the commonalities, thus my confusion. But again, i have a bit of understanding now. Maybe a good nights sleep will help..."
		},
		{
		"date":"4/21/2015",
		"title":"Hi, Otto!",
		"text":"&#91disclaimer: see above disclaimer&#93<br><br>So I finally settled on a personal project and made decent headway on the interface portion using WConio (after spending an hour with Curses, which is for Unix, not Windows). After being down a bit yesterday I'm okay again. The latest lab assignments presented some interesting challenges. I handled the logic just fine, the commands came to me, and the syntax was eventually fixed, only because things wouldn't run otherwise. I am bit surprised that as I learn more advanced things the simple things can still trip me up. As I switch between more languages in the future, I can see this being an annoying (even if not insurmountable) problem."
		},
		{
		"date":"...sometime in the future?",
		"title":"Dang, that was easy!",
		"text":"&#91disclaimer: see above disclaimer&#93<br><br>Not to brag, but I think I have mastered everything. Not just in code, but in life."
		}
	]
}